In [2]:
# Importar librería para la conexión con MySQL
# -----------------------------------------------------------------------
import mysql.connector
from mysql.connector import errorcode


# Importar librerías para manipulación y análisis de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np

from tqdm import tqdm

In [3]:
#Creo la BBDD:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1')


mycursor = cnx.cursor()
try:
    mycursor.execute("CREATE DATABASE ABC_corporation")
    print(mycursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

MySQLCursor: CREATE DATABASE ABC_corporation

----
**Registro**

In [7]:
df = pd.read_csv("../DATA/df_clean_sin_duplicados.csv",index_col=0)

In [8]:
df.head()

,AGE,ATTRITION,BUSINESSTRAVEL,DEPARTMENT,DISTANCEFROMHOME,EDUCATION,EDUCATIONFIELD,EMPLOYEENUMBER,ENVIRONMENTSATISFACTION,GENDER,...,STOCKOPTIONLEVEL,TRAININGTIMESLASTYEAR,WORKLIFEBALANCE,YEARSATCOMPANY,YEARSSINCELASTPROMOTION,YEARSWITHCURRMANAGER,REMOTEWORK,DAILYRATE,PERFORMANCERATING,TOTALWORKINGYEARS
0,51.0,no,Unknown,Unknown,6,3,Unknown,162.0,1,male,...,0,5,3.0,20,15,15,1,684.0,3.0,11.223167
1,52.0,no,Unknown,Unknown,1,4,life sciences,259.0,3,male,...,1,5,3.0,33,11,9,1,699.0,3.0,34.000000
2,42.0,no,travel rarely,research & development,4,2,technical degree,319.0,3,male,...,0,3,3.0,22,11,15,1,532.0,3.0,22.000000
3,47.0,no,travel rarely,Unknown,2,4,medical,Unknown,1,female,...,2,2,3.0,20,5,6,0,359.0,3.0,10.971828
4,46.0,no,Unknown,Unknown,3,3,technical degree,Unknown,1,female,...,1,5,3.0,19,2,8,0,1319.0,3.0,11.714245

In [10]:
def ejecutar_query(query):
    cnx = mysql.connector.connect(
    user='root', password='AlumnaAdalab',
    host='127.0.0.1', database='ABC_corporation'
    )

    mycursor = cnx.cursor()

    # Ejecuta la instrucción SQL para crear la tabla
    try:
        mycursor.execute(query)
        print("Tabla creada correctamente.")
    except mysql.connector.Error as err:
        print("Error al crear la tabla:", err)

    # Cierra el cursor y la conexión a la base de datos
    mycursor.close()
    cnx.close()

In [6]:
# Creo la tabla para las employees

tabla_registro = """
CREATE TABLE IF NOT EXISTS registro (     

    ID_REGISTO autoincrement
    DISTANCEFROMHOME
    REMOTEWORK
    MONTHLYINCOME
    HOURLYRATE
    OVERTIME
    ENVIRONMENTSATISFACTION



    AGE int DEFAULT NULL,
    GENDER VARCHAR(50) DEFAULT NULL,
    MARITAL_STATUS VARCHAR(50) DEFAULT NULL,
    EDUCATION INT DEFAULT NULL,
    EDUCATION_FIELD VARCHAR(100) DEFAULT NULL,
    EMPLOYEE_NUMBER INT NOT NULL PRIMARY KEY
    )
    """

tabla_employee = 

tabla_employee_empresa =

Tabla creada correctamente.

In [ ]:
# Llamamos a la funcion para crear la tabla
ejecutar_query(tabla_registro)

In [7]:
# Insertar información de las employees

cnx = mysql.connector.connect(
    user='root', password='AlumnaAdalab',
    host='127.0.0.1', database='ABC_corporation'
)

mycursor = cnx.cursor()

# Lee el archivo CSV
df = pd.read_csv("")
lista_employe_number= []

# Define el rango de filas sobre el cual iterar
inicio =   
fin = 

# Itera sobre el rango de filas especificado del DataFrame
for index in tqdm(range(inicio, fin), desc="Insertando registros"):
    row = df.iloc[index]  # Obtén la fila en el índice actual
    sql = "INSERT INTO employees (AGE, GENDER, MARITAL_STATUS, EDUCATION, EDUCATION_FIELD, EMPLOYEE_NUMBER) VALUES (%s, %s, %s, %s, %s, %s)"

    val = (row['AGE'], row['GENDER'], row['MARITAL_STATUS'], row['EDUCATION'], row['EDUCATION_FIELD'], row['EMPLOYEE_NUMBER'])


    

    try:
        mycursor.execute(sql, val)
        cnx.commit()  # Confirma la transacción
    except mysql.connector.Error as err:
        cnx.rollback()  # Revierte la transacción si hay un error
        print("Error al insertar registro:", err)

# Cierra el cursor y la conexión a la base de datos
mycursor.close()
cnx.close()

Insertando registros:  13%|█▎        | 66578/524321 [01:44<11:20, 672.79it/s]

Error al insertar registro: 1406 (22001): Data too long for column 'Titulo' at row 1

Insertando registros: 100%|█████████▉| 524320/524321 [13:19<00:00, 655.49it/s]

IndexError: single positional indexer is out-of-bounds